<template>
  <div class="mt-4">
    <template v-for="(item, index) in items">
      <v-divider class="my-6"></v-divider>
      <ShopReview
        :user="item.user"
        :date="item.date"
        :src="item.src"
        :text="item.text"
      />
    </template>
    <v-divider class="my-6"></v-divider>
    <div class="text-center">
      <v-pagination
        v-model="page"
        :length="15"
        :total-visible="5"
        circle
        color="chip_color"
      ></v-pagination>
    </div>
  </div>
</template>
<script>
export default {
  data: () => ({
    page: 1,
    items: [
      {
        user: 'おおばやし',
        date: '2021/03/02',
        src: '/images/shop.jpg',
        text: '極楽寺駅から徒歩1分のところにあるお店。\nコロナのため、入店時のマスク着用は必須。\n店内に入ると温かいお茶をだしてくれる。お茶を飲みながらゆっくり服をさがせるのはこの店ならではだと思う。\n店主の中学生の息子がバイトをしており、たどたどしい接客で試着室に案内してくれるのも可愛らしい。\n\n肝心の古着についてだが、全体的に価格が安い。\nかと言って状態が悪いわけではない。\n店主自身が状態の悪いものは自身でリペアを施して販売しているらしい。\nまた、立地の問題もあるだろうが都内で販売されているものと比べても3割ほど安い値段で価格設定がされているように感じる。\n\n店主はとても気さくで私がデニムをさがしていることがわかると壁一面に並んだ大量のデニムの中から私がほしい特徴のデニムを見つけてくれた。\n私の質問にもまったく気取った態度はとらず丁寧に答えてくれた。\n本当に古着が好きなことがわかるような気さくなおじさんであった。\n\nまた、デニムが欲しくなった時には買いに行きたいと思う。',
      },
      {
        user: 'おおばやし',
        date: '2021/03/02',
        src: '/images/shop.jpg',
        text: '極楽寺駅から徒歩1分のところにあるお店。\nコロナのため、入店時のマスク着用は必須。\n店内に入ると温かいお茶をだしてくれる。お茶を飲みながらゆっくり服をさがせるのはこの店ならではだと思う。\n店主の中学生の息子がバイトをしており、たどたどしい接客で試着室に案内してくれるのも可愛らしい。\n\n肝心の古着についてだが、全体的に価格が安い。\nかと言って状態が悪いわけではない。\n店主自身が状態の悪いものは自身でリペアを施して販売しているらしい。\nまた、立地の問題もあるだろうが都内で販売されているものと比べても3割ほど安い値段で価格設定がされているように感じる。\n\n店主はとても気さくで私がデニムをさがしていることがわかると壁一面に並んだ大量のデニムの中から私がほしい特徴のデニムを見つけてくれた。\n私の質問にもまったく気取った態度はとらず丁寧に答えてくれた。\n本当に古着が好きなことがわかるような気さくなおじさんであった。\n\nまた、デニムが欲しくなった時には買いに行きたいと思う。',
      },
      {
        user: 'おおばやし',
        date: '2021/03/02',
        src: '/images/shop.jpg',
        text: '極楽寺駅から徒歩1分のところにあるお店。\nコロナのため、入店時のマスク着用は必須。\n店内に入ると温かいお茶をだしてくれる。お茶を飲みながらゆっくり服をさがせるのはこの店ならではだと思う。\n店主の中学生の息子がバイトをしており、たどたどしい接客で試着室に案内してくれるのも可愛らしい。\n\n肝心の古着についてだが、全体的に価格が安い。\nかと言って状態が悪いわけではない。\n店主自身が状態の悪いものは自身でリペアを施して販売しているらしい。\nまた、立地の問題もあるだろうが都内で販売されているものと比べても3割ほど安い値段で価格設定がされているように感じる。\n\n店主はとても気さくで私がデニムをさがしていることがわかると壁一面に並んだ大量のデニムの中から私がほしい特徴のデニムを見つけてくれた。\n私の質問にもまったく気取った態度はとらず丁寧に答えてくれた。\n本当に古着が好きなことがわかるような気さくなおじさんであった。\n\nまた、デニムが欲しくなった時には買いに行きたいと思う。',
      },
      {
        user: 'おおばやし',
        date: '2021/03/02',
        src: '/images/shop.jpg',
        text: '極楽寺駅から徒歩1分のところにあるお店。\nコロナのため、入店時のマスク着用は必須。\n店内に入ると温かいお茶をだしてくれる。お茶を飲みながらゆっくり服をさがせるのはこの店ならではだと思う。\n店主の中学生の息子がバイトをしており、たどたどしい接客で試着室に案内してくれるのも可愛らしい。\n\n肝心の古着についてだが、全体的に価格が安い。\nかと言って状態が悪いわけではない。\n店主自身が状態の悪いものは自身でリペアを施して販売しているらしい。\nまた、立地の問題もあるだろうが都内で販売されているものと比べても3割ほど安い値段で価格設定がされているように感じる。\n\n店主はとても気さくで私がデニムをさがしていることがわかると壁一面に並んだ大量のデニムの中から私がほしい特徴のデニムを見つけてくれた。\n私の質問にもまったく気取った態度はとらず丁寧に答えてくれた。\n本当に古着が好きなことがわかるような気さくなおじさんであった。\n\nまた、デニムが欲しくなった時には買いに行きたいと思う。',
      },
      {
        user: 'おおばやし',
        date: '2021/03/02',
        src: '/images/shop.jpg',
        text: '極楽寺駅から徒歩1分のところにあるお店。\nコロナのため、入店時のマスク着用は必須。\n店内に入ると温かいお茶をだしてくれる。お茶を飲みながらゆっくり服をさがせるのはこの店ならではだと思う。\n店主の中学生の息子がバイトをしており、たどたどしい接客で試着室に案内してくれるのも可愛らしい。\n\n肝心の古着についてだが、全体的に価格が安い。\nかと言って状態が悪いわけではない。\n店主自身が状態の悪いものは自身でリペアを施して販売しているらしい。\nまた、立地の問題もあるだろうが都内で販売されているものと比べても3割ほど安い値段で価格設定がされているように感じる。\n\n店主はとても気さくで私がデニムをさがしていることがわかると壁一面に並んだ大量のデニムの中から私がほしい特徴のデニムを見つけてくれた。\n私の質問にもまったく気取った態度はとらず丁寧に答えてくれた。\n本当に古着が好きなことがわかるような気さくなおじさんであった。\n\nまた、デニムが欲しくなった時には買いに行きたいと思う。',
      },
    ],
  }),
}
</script>